Notes/daily/2021-12-12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-12-12</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2021-12-12</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2022-01-23.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd92d461">Diary entry</a>
<ul>
<li><a href="#org24102b1">What have I done since the last entry?</a></li>
<li><a href="#orgc646261">What have I learned &amp; how?</a></li>
<li><a href="#org6cff1c1">What worked well?</a></li>
<li><a href="#org1c20866">What would I do differently next time?</a></li>
</ul>
</li>
<li><a href="#org35b3fa4">What will I do over the holidays?</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd92d461" class="outline-2">
<h2 id="orgd92d461">Diary entry</h2>
<div class="outline-text-2" id="text-orgd92d461">
<p>
It has been 2 weeks since the last entry, so I've got quite a bit to catch up on
</p>
</div>
<div id="outline-container-org24102b1" class="outline-3">
<h3 id="org24102b1">What have I done since the last entry?</h3>
<div class="outline-text-3" id="text-org24102b1">
<ul class="org-ul">
<li>I took a tech-week and explored some interesting technology that I've not used before; most of them (for instance <a href="https://geti2p.net/en/">I2P</a>) aren't useful for this project, but <a href="https://nixos.org/">NixOS</a> looks incredibly interesting. It can be used to <a href="https://nixos.org/#asciinema-demo-example_4">build docker images</a> (which means it is compatible with containerd), and allows far more consistency than other methods I was considering, infact <a href="https://nixos.org/#asciinema-demo-cover">the docker images can end up <i>smaller</i> than alpine linux</a></li>
<li>I did some API design with <a href="https://stoplight.io/studio/">stoplight studio</a>; I still haven't designed the full spec but I have some basic info</li>
</ul>
</div>
</div>
<div id="outline-container-orgc646261" class="outline-3">
<h3 id="orgc646261">What have I learned &amp; how?</h3>
<div class="outline-text-3" id="text-orgc646261">
<ul class="org-ul">
<li>I've learned more about building containers</li>
<li>I've learned more about making APIs</li>
<li>I've thought more about how I need to design my API</li>
</ul>
</div>
</div>
<div id="outline-container-org6cff1c1" class="outline-3">
<h3 id="org6cff1c1">What worked well?</h3>
<div class="outline-text-3" id="text-org6cff1c1">
<ul class="org-ul">
<li>Stoplight studio is a brilliant program for API design and prototyping</li>
</ul>
</div>
</div>
<div id="outline-container-org1c20866" class="outline-3">
<h3 id="org1c20866">What would I do differently next time?</h3>
<div class="outline-text-3" id="text-org1c20866">
<ul class="org-ul">
<li>I would better record and log what I have done, both as I do it and making more diary entries</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org35b3fa4" class="outline-2">
<h2 id="org35b3fa4">What will I do over the holidays?</h2>
<div class="outline-text-2" id="text-org35b3fa4">
<p>
I'm not going to schedule any more time than the 2 hours already set out each sunday over the holidays, and here's why:
</p>
<ul class="org-ul">
<li>My mental health has been not so good, and it's getting worse. This is due to a lot too much stress, and <i>I need a break</i>.</li>
<li>I'm already doing well on my EPQ; I have the time to avoid scheduling much more time</li>
<li>I have several other projects and holiday homework that I have made commitments to complete far earlier than the EPQ; these must take priority in my scheduling</li>
</ul>

<p>
This is not to say that I won't do my EPQ more than that over the holidays, I enjoy doing the EPQ and I find it more relaxing and freeing than some other tasks I have to do, but I <i>will not</i> make a formal commitment to make any further time. I understand that this is probably not what you meant by 'create an EP Christmas holidays plan', and for this I apologise.
</p>
</div>
</div>
</div>
</body>
</html>
